#ifndef GREP_MAIN_H
#define GREP_MAIN_H

#include <stdio.h>
#include <getopt.h>
#include <unistd.h>

typedef struct flags {
    int e, i, v, c, l, n, h, s, f, o;
} flags;

    int noArg(void);
    void pars_flags(argc, argv,)

#endif //GREP_MAIN_H

/*Опция	Описание
-i	Игнорировать регистр. Не делать различия между большими и маленькими
символами. Также можно задать опцией --ignore-case. -v	Инвертировать
соответствие. Обычно grep печатает строки, которые содержат соответствие. Эта
опция приводит к тому, что grep выводит каждую строку, которая не содержит
соответствия. Также можно использовать --invert-match.
-c	Печатать количество соответствий (или несоответствий, если указана опция
-v) вместо самих строк. Можно также указывать опцией --count.
-l	Вместо самих строк печатать имя каждого файла, который содержит
соответствие. Можно указать опцией --files-with-matches. -L	Как опция -l, но
печатает только имена файлов, которые не содержат совпадений. Другое имя опции
--files-withoutmatch.
-n	Добавление к началу каждой совпавшей строке номера строчки внутри файла.
Другое имя опции --line-number. -h	Для поиска по нескольким файлам,
подавлять вывод имени файла. Также можно указать опцией --no-filename.*/